# Να γράψετε μία συνάρτηση η οποία να υπολογίζει 
# την συχνότητα εμφάνισης ενός γράμματος σε μία συμβολοσειρά 
# (και το αντίστοιχο πρόγραμμα που την καλεί). 

def timesOf(c, string):
    times = 0
    for i in string:
        if c == i:
            times +=1
    return times

string = input("Δώσε μια γραμματοσειρά: ")
c = input("Δώσε έναν χαρακτήρα: ")

times = timesOf(c, string)
if times == 0:
    print(f"To '{c}' δεν υπάρχει μέσα στην γραμματοσειρά.")
elif times == 1:
    print(f"To '{c}' υπάρχει μέσα στην γραμματοσειρά μία φορά.")
else:
    print(f"To '{c}' υπάρχει μέσα στην γραμματοσειρά {times} φορές.")