# Αφού δημιουργηθεί ένα αγγλοελληνικό λεξικό 
# να ζητάει από τον χρήστη να εισάγει την αγγλική μετάφραση 
# όλων των λέξεων και να του επιστρέφει σωστό/λάθος 
# (στην περίπτωση λάθους να εκτυπώνει την σωστή μετάφραση). 
# Στο τέλος να εκτυπώνει πόσες σωστές απαντήσεις έδωσε.

dictionary = {"hello":"γεια", "goodmorning": "καλημέρα", "next": "επόμενος"}

correct_answers = 0

for word in dictionary:
    answer = input(f"{word}: ")
    if answer == dictionary[word]:
        print("ΣΩΣΤΟ!")
        correct_answers += 1
    else:
        print("ΛΑΘΟΣ!")

print(f"\nΈδωσες συνολικά {correct_answers} σωστές απαντήσεις.")